3.13.5 | packaged by Anaconda, Inc. | (main, Jun 12 2025, 11:23:37) [Clang 14.0.6 ]

In [4]:
import numpy as np

In [5]:
arr = np.array([10,20,30,40])
arr.max()

np.int64(40)

In [6]:
arr.shape

(4,)

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv("sample_data1 - Sheet1.csv")
df.head()

,Employee_ID,Department,Region,Salary,Experience_Years,Performance_Rating,Monthly_Sales
0,1001,Sales,North,45000,2,4.0,120000.0
1,1002,Marketing,South,52000,3,3.0,98000.0
2,1003,Sales,East,47000,4,5.0,150000.0
3,1004,HR,West,40000,1,3.0,0.0
4,1005,IT,North,60000,5,4.0,0.0

In [5]:
df.describe()

,Employee_ID,Salary,Experience_Years,Performance_Rating,Monthly_Sales
count,15.000000,15.000000,15.000000,14.000000,14.000000
mean,1008.000000,49666.666667,3.200000,3.785714,76928.571429
std,4.472136,7158.079019,1.373213,0.892582,62039.025293
min,1001.000000,39000.000000,1.000000,2.000000,0.000000
25%,1004.500000,45500.000000,2.000000,3.000000,0.000000
50%,1008.000000,49000.000000,3.000000,4.000000,95000.000000
75%,1011.500000,52500.000000,4.000000,4.000000,128750.000000
max,1015.000000,62000.000000,6.000000,5.000000,150000.000000

In [6]:
df.tail()

,Employee_ID,Department,Region,Salary,Experience_Years,Performance_Rating,Monthly_Sales
10,1011,Sales,East,50000,4,5.0,140000.0
11,1012,Marketing,West,53000,3,NaN,92000.0
12,1013,IT,North,61000,5,4.0,NaN
13,1014,Sales,South,49000,3,4.0,135000.0
14,1015,HR,East,42000,2,3.0,0.0

In [7]:
df.isnull().sum()

Employee_ID           0
Department            0
Region                0
Salary                0
Experience_Years      0
Performance_Rating    1
Monthly_Sales         1
dtype: int64

In [8]:
df.sample(10)

,Employee_ID,Department,Region,Salary,Experience_Years,Performance_Rating,Monthly_Sales
4,1005,IT,North,60000,5,4.0,0.0
2,1003,Sales,East,47000,4,5.0,150000.0
3,1004,HR,West,40000,1,3.0,0.0
13,1014,Sales,South,49000,3,4.0,135000.0
11,1012,Marketing,West,53000,3,NaN,92000.0
14,1015,HR,East,42000,2,3.0,0.0
7,1008,IT,West,62000,6,5.0,0.0
9,1010,HR,South,39000,2,3.0,0.0
5,1006,Sales,South,48000,3,4.0,130000.0
0,1001,Sales,North,45000,2,4.0,120000.0

In [9]:
df.shape

(15, 7)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Employee_ID         15 non-null     int64
 1   Department          15 non-null     object
 2   Region              15 non-null     object
 3   Salary              15 non-null     int64
 4   Experience_Years    15 non-null     int64
 5   Performance_Rating  14 non-null     float64
 6   Monthly_Sales       14 non-null     float64
dtypes: float64(2), int64(3), object(2)
memory usage: 972.0+ bytes

Assignment

In [12]:
sales_data = pd.read_csv("sample_data1 - Sheet1.csv")
emp_data = pd.read_csv("employee_attrition - Sheet1.csv")
tele_data = pd.read_csv("telecom_churn - Sheet1.csv")

#Number of rows

In [16]:
print("Number of rows :", sales_data.shape[0])
print("Number of rows :", emp_data.shape[0])
print("Number of rows :", tele_data.shape[0])

15

#Which col has missing value?

In [23]:
col1 = sales_data.isnull().sum()
print(col1[col1!=0])

Performance_Rating    1
Monthly_Sales         1
dtype: int64

In [24]:
col2 = emp_data.isnull().sum()
print(col2[col2!=0])

Job_Satisfaction    1
dtype: int64

In [25]:
col3 = tele_data.isnull().sum()
print(col3[col3!=0])

Churn    1
dtype: int64

#Average Salary

In [40]:
sales_data.head()

,Employee_ID,Department,Region,Salary,Experience_Years,Performance_Rating,Monthly_Sales
0,1001,Sales,North,45000,2,4.0,120000.0
1,1002,Marketing,South,52000,3,3.0,98000.0
2,1003,Sales,East,47000,4,5.0,150000.0
3,1004,HR,West,40000,1,3.0,0.0
4,1005,IT,North,60000,5,4.0,0.0

In [54]:
print("Average Salary in sales data ",sales_data["Salary"].mean().round(2))

Average Salary in sales data  49666.67

In [53]:
print("Average Monthly Expenses in Employment data ",emp_data["Monthly_Income"].mean().round(2))

Average Monthly Expenses in Employment data  56533.33

In [55]:
print("Average Monthly Charges in Employment data ",tele_data["Monthly_Charges"].mean().round(2))

Average Monthly Charges in Employment data  702.67

Which department has max emp

In [52]:
max_val = 0
max_dept = ""
l = [emp_data,sales_data]
for idx in l:
    for dept in idx["Department"]:
        if len(dept) > max_val:
            max_val = len(dept)
            max_dept = dept
    print("Max Department",max_dept)

Max Department Finance
Max Department Marketing

In [57]:
sales_data.head()

,Employee_ID,Department,Region,Salary,Experience_Years,Performance_Rating,Monthly_Sales
0,1001,Sales,North,45000,2,4.0,120000.0
1,1002,Marketing,South,52000,3,3.0,98000.0
2,1003,Sales,East,47000,4,5.0,150000.0
3,1004,HR,West,40000,1,3.0,0.0
4,1005,IT,North,60000,5,4.0,0.0